{
  "backend/main.mo": "Main Motoko actor defining all backend logic for SkillSwap: user profile management, skill exchange requests, in-platform messaging (restricted to accepted matches), ratings, and a skill directory with search — all gated by an access control mixin.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (profile management, skill browsing, exchange matching, messaging, ratings) to the frontend/backend files and test IDs that implement them.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of five key frontend source files (App.tsx, useRouter.ts, ConversationThread.tsx, Layout.tsx, HeroSection.tsx) for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for the design system's color tokens (background, foreground, primary, secondary, etc.) in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the SkillSwap SPA, mounting the React app into a root div and loading the Vite entry module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, directory, profile, user profile, dashboard, messages) and wraps them in a layout that conditionally shows the profile setup modal.",
  "frontend/src/components/ConversationThread.tsx": "Messaging UI component that renders a scrollable thread of chat bubbles between two matched users, with polling-based refresh, Enter-to-send keyboard shortcut, and access-guard messaging for unmatched users.",
  "frontend/src/components/Dashboard.tsx": "Dashboard page component displaying the authenticated user's active skill exchanges and incoming exchange requests, with navigation to message threads and a rating modal for exchange partners.",
  "frontend/src/components/ExchangeRequestsList.tsx": "Displays a list of pending incoming skill exchange requests for the current user, with each card showing sender info, skills being exchanged, and an accept button that triggers the accept mutation.",
  "frontend/src/components/HeroSection.tsx": "Renders the landing page hero section with a headline, description, explore/join buttons, stat badges, and a hero illustration image.",
  "frontend/src/components/Layout.tsx": "Provides the app shell with a sticky header containing the logo, navigation links, authentication controls (login/logout), and a mobile menu toggle, wrapping page content as children.",
  "frontend/src/components/ProfilePage.tsx": "Full profile editing page that lets authenticated users view and update their name, bio, offered skills, and wanted skills, with inline skill form management and save/cancel controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Multi-step onboarding dialog for new users to create their profile by entering name, bio, and at least one offered and one wanted skill before submitting.",
  "frontend/src/components/RatingModal.tsx": "Dialog component that allows a user to submit a 1–5 star rating and optional text review for another user after a skill exchange.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of user reviews/ratings in a card, showing reviewer name, star rating, date, and review text. Fetches ratings and reviewer profiles via custom query hooks.",
  "frontend/src/components/SkillDirectory.tsx": "Renders a searchable directory of all user profiles and their offered skills, with debounced filtering by skill name, category, description, or user name.",
  "frontend/src/components/UserProfileView.tsx": "Shows a detailed view of a user's profile including skills, average rating, reviews, and a skill-exchange request form with match detection against the logged-in user's profile.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, identity persistence via AuthClient, and a React context provider and hook for consuming auth state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including profile CRUD, skill search, exchange request management, messaging, and ratings.",
  "frontend/src/hooks/useRouter.ts": "Re-exports and wraps TanStack Router utilities (useNavigate, Link) and provides a useLocation shim and a useNavigateTo helper for programmatic navigation.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Fraunces, Inter), sets up Tailwind directives, and defines a warm earthy OKLCH color palette with CSS variables for both light and dark themes, plus custom utility classes for skill tags and match glow effects.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/matchDetection.ts": "Utility that detects complementary skill matches between two user profiles, returning pairs where each user offers what the other wants.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color palettes (terracotta, sage, sand), Fraunces/Inter font families, custom border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing a peer-to-peer skill exchange web app, listing implemented features (profiles, search, matching, messaging, ratings), architectural notes, and image requirements."
}